cmsis-svd/cmsis-svd/data/Microchip/ATSAM4LC.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>BSCIF</name>
      <version>1.0.0</version>
      <description>Backup System Control Interface</description>
      <groupName>BSCIF</groupName>
      <prependToName>BSCIF_</prependToName>
      <baseAddress>0x400F0400</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>BSCIF_INTREQ</name>
        <value>38</value>
      </interrupt>
      <registers>
        <register>
          <name>IER</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>OSC32RDY</name>
              <description>32kHz Oscillator Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RC32KRDY</name>
              <description>32kHz RC Oscillator Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RC32KLOCK</name>
              <description>32kHz RC Oscillator Lock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RC32KREFE</name>
              <description>32kHz RC Oscillator Reference Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RC32KSAT</name>
              <description>32kHz RC Oscillator Saturation</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BOD33DET</name>
              <description>BOD33 Detected</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BOD18DET</name>
              <description>BOD18 Detected</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BOD33SYNRDY</name>
              <description>BOD33 Synchronization Ready</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BOD18SYNRDY</name>
              <description>BOD18 Synchronization Ready</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SSWRDY</name>
              <description>VREG Stop Switching Ready</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>VREGOK</name>
              <description>Main VREG OK</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LPBGRDY</name>
              <description>Low Power Bandgap Voltage Reference Ready</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AE</name>
              <description>Access Error</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>Interrupt Disable Register</description>
          <addressOffset>0x004</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>OSC32RDY</name>
              <description>32kHz Oscillator Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RC32KRDY</name>
              <description>32kHz RC Oscillator Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RC32KLOCK</name>
              <description>32kHz RC Oscillator Lock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RC32KREFE</name>
              <description>32kHz RC Oscillator Reference Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RC32KSAT</name>
              <description>32kHz RC Oscillator Saturation</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BOD33DET</name>
              <description>BOD33 Detected</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BOD18DET</name>
              <description>BOD18 Detected</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BOD33SYNRDY</name>
              <description>BOD33 Synchronization Ready</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BOD18SYNRDY</name>
              <description>BOD18 Synchronization Ready</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SSWRDY</name>
              <description>VREG Stop Switching Ready</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>VREGOK</name>
              <description>Mai n VREG OK</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LPBGRDY</name>
              <description>Low Power Bandgap Voltage Reference Ready</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AE</name>
              <description>Access Error</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>Interrupt Mask Register</description>
          <addressOffset>0x008</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>OSC32RDY</name>
              <description>32kHz Oscillator Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC32KRDY</name>
              <description>32kHz RC Oscillator Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC32KLOCK</name>
              <description>32kHz RC Oscillator Lock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC32KREFE</name>
              <description>32kHz RC Oscillator Reference Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC32KSAT</name>
              <description>32kHz RC Oscillator Saturation</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD33DET</name>
              <description>BOD33 Detected</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD18DET</name>
              <description>BOD18 Detected</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD33SYNRDY</name>
              <description>BOD33 Synchronization Ready</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD18SYNRDY</name>
              <description>BOD18 Synchronization Ready</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SSWRDY</name>
              <description>VREG Stop Switching Ready</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VREGOK</name>
              <description>Main VREG OK</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPBGRDY</name>
              <description>Low Power Bandgap Voltage Reference Ready</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE</name>
              <description>Access Error</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x00C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>OSC32RDY</name>
              <description>32kHz Oscillator Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC32KRDY</name>
              <description>32kHz RC Oscillator Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC32KLOCK</name>
              <description>32kHz RC Oscillator Lock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC32KREFE</name>
              <description>32kHz RC Oscillator Reference Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC32KSAT</name>
              <description>32kHz RC Oscillator Saturation</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD33DET</name>
              <description>BOD33 Detected</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD18DET</name>
              <description>BOD18 Detected</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD33SYNRDY</name>
              <description>BOD33 Synchronization Ready</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD18SYNRDY</name>
              <description>BOD18 Synchronization Ready</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SSWRDY</name>
              <description>VREG Stop Switching Ready</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VREGOK</name>
              <description>Main VREG OK</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPBGRDY</name>
              <description>Low Power Bandgap Voltage Reference Ready</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE</name>
              <description>Access Error</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>Interrupt Clear Register</description>
          <addressOffset>0x010</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>OSC32RDY</name>
              <description>32kHz Oscillator Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RC32KRDY</name>
              <description>32kHz RC Oscillator Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RC32KLOCK</name>
              <description>32kHz RC Oscillator Lock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RC32KREFE</name>
              <description>32kHz RC Oscillator Reference Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RC32KSAT</name>
              <description>32kHz RC Oscillator Saturation</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BOD33DET</name>
              <description>BOD33 Detected</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BOD18DET</name>
              <description>BOD18 Detected</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BOD33SYNRDY</name>
              <description>BOD33 Synchronization Ready</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BOD18SYNRDY</name>
              <description>BOD18 Synchronization Ready</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SSWRDY</name>
              <description>VREG Stop Switching Ready</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>VREGOK</name>
              <description>Main VREG OK</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LPBGRDY</name>
              <description>Low Power Bandgap Voltage Reference Ready</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AE</name>
              <description>Access Error</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCLKSR</name>
          <description>Power and Clocks Status Register</description>
          <addressOffset>0x014</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>OSC32RDY</name>
              <description>32kHz Oscillator Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC32KRDY</name>
              <description>32kHz RC Oscillator Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC32KLOCK</name>
              <description>32kHz RC Oscillator Lock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC32KREFE</name>
              <description>32kHz RC Oscillator Reference Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC32KSAT</name>
              <description>32kHz RC Oscillator Saturation</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD33DET</name>
              <description>BOD33 Detected</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD18DET</name>
              <description>BOD18 Detected</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD33SYNRDY</name>
              <description>BOD33 Synchronization Ready</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD18SYNRDY</name>
              <description>BOD18 Synchronization Ready</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SSWRDY</name>
              <description>VREG Stop Switching Ready</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VREGOK</name>
              <description>Main VREG OK</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC1MRDY</name>
              <description>RC 1MHz Oscillator Ready</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPBGRDY</name>
              <description>Low Power Bandgap Voltage Reference Ready</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
