cmsis-svd/cmsis-svd/data/Microchip/ATSAM4LC.svd
        <register>
          <name>UNLOCK</name>
          <description>Unlock Register</description>
          <addressOffset>0x018</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Unlock Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>KEY</name>
              <description>Unlock Key</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <name>KEYSelect</name>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Valid Key to Unlock register</description>
                  <value>0xaa</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSCR</name>
          <description>Chip Specific Configuration Register</description>
          <addressOffset>0x01C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>OSCCTRL32</name>
          <description>Oscillator 32 Control Register</description>
          <addressOffset>0x020</addressOffset>
          <size>32</size>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>OSC32EN</name>
              <description>32 KHz Oscillator Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PINSEL</name>
              <description>Pins Select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN32K</name>
              <description>32 KHz output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN1K</name>
              <description>1 KHz output Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>Oscillator Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SELCURR</name>
              <description>Current selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>STARTUP</name>
              <description>Oscillator Start-up Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RC32KCR</name>
          <description>32 kHz RC Oscillator Control Register</description>
          <addressOffset>0x024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable as Generic clock source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCEN</name>
              <description>Temperature Compensation Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN32K</name>
              <description>Enable 32 KHz output</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN1K</name>
              <description>Enable 1 kHz output</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>Mode Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REF</name>
              <description>Reference select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCD</name>
              <description>Flash calibration done</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RC32KTUNE</name>
          <description>32kHz RC Oscillator Tuning Register</description>
          <addressOffset>0x028</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FINE</name>
              <description>Fine value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>COARSE</name>
              <description>Coarse Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BOD33CTRL</name>
          <description>BOD33 Control Register</description>
          <addressOffset>0x02C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HYST</name>
              <description>BOD Hysteresis</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACTION</name>
              <description>Action</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>Operation modes</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCD</name>
              <description>BOD Fuse Calibration Done</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFV</name>
              <description>BOD Control Register Store Final Value</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BOD33LEVEL</name>
          <description>BOD33 Level Register</description>
          <addressOffset>0x030</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VAL</name>
              <description>BOD Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BOD33SAMPLING</name>
          <description>BOD33 Sampling Control Register</description>
          <addressOffset>0x034</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CEN</name>
              <description>Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSSEL</name>
              <description>Clock Source Select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PSEL</name>
              <description>Prescaler Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BOD18CTRL</name>
          <description>BOD18 Control Register</description>
          <addressOffset>0x038</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HYST</name>
              <description>BOD Hysteresis</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACTION</name>
              <description>Action</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>Operation modes</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCD</name>
              <description>BOD Fuse Calibration Done</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFV</name>
              <description>BOD Control Register Store Final Value</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BOD18LEVEL</name>
          <description>BOD18 Level Register</description>
          <addressOffset>0x03C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VAL</name>
              <description>BOD Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>RANGE</name>
              <description>BOD Threshold Range</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VREGCR</name>
          <description>Voltage Regulator Configuration Register</description>
          <addressOffset>0x044</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DIS</name>
              <description>Voltage Regulator disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSG</name>
              <description>Spread Spectrum Generator Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSW</name>
              <description>Stop Switching</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSWEVT</name>
              <description>Stop Switching On Event Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFV</name>
              <description>Store Final Value</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VREGNCSR</name>
          <description>Normal Mode Control and Status Register</description>
          <addressOffset>0x04C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>VREGLPCSR</name>
          <description>LP Mode Control and Status Register</description>
          <addressOffset>0x050</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>RC1MCR</name>
          <description>1MHz RC Clock Configuration Register</description>
          <addressOffset>0x058</addressOffset>
          <size>32</size>
          <resetValue>0x00000F00</resetValue>
          <fields>
            <field>
              <name>CLKOE</name>
              <description>1MHz RC Osc Clock Output Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCD</name>
              <description>Flash Calibration Done</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKCAL</name>
              <description>1MHz RC Osc Calibration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BGCR</name>
          <description>Bandgap Calibration Register</description>
          <addressOffset>0x05C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>BGCTRL</name>
          <description>Bandgap Control Register</description>
          <addressOffset>0x060</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADCISEL</name>
              <description>ADC Input Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>ADCISELSelect</name>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VTEMP</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREF</name>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSEN</name>
              <description>Temperature Sensor Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BGSR</name>
          <description>Bandgap Status Register</description>
          <addressOffset>0x064</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BGBUFRDY</name>
              <description>Bandgap Buffer Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>BGBUFRDYSelect</name>
                <enumeratedValue>
                  <name>FLASH</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL</name>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREG</name>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFRR</name>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC</name>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCD</name>
                  <value>0x20</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BGRDY</name>
              <description>Bandgap Voltage Reference Ready</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPBGRDY</name>
              <description>Low Power Bandgap Voltage Reference Ready</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VREF</name>
              <description>Voltage Reference Used by the System</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>BR%s</name>
          <description>Backup Register</description>
          <addressOffset>0x078</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>BRIFBVERSION</name>
          <description>Backup Register Interface Version Register</description>
          <addressOffset>0x3E4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000100</resetValue>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Version Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Variant Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BGREFIFBVERSION</name>
          <description>BGREFIFB Version Register</description>
          <addressOffset>0x3E8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000110</resetValue>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Version Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Variant Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VREGIFGVERSION</name>
          <description>VREGIFA Version Register</description>
          <addressOffset>0x3EC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000110</resetValue>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Version Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Variant Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BODIFCVERSION</name>
          <description>BODIFC Version Register</description>
          <addressOffset>0x3F0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000110</resetValue>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Version Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Variant Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RC32KIFBVERSION</name>
          <description>32 kHz RC Oscillator Version Register</description>
          <addressOffset>0x3F4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000100</resetValue>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Version number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Variant number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC32IFAVERSION</name>
          <description>32 KHz Oscillator Version Register</description>
          <addressOffset>0x3F8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000200</resetValue>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Version number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Variant nubmer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VERSION</name>
          <description>BSCIF Version Register</description>
          <addressOffset>0x3FC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000100</resetValue>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Version Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Variant Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
