cmsis-svd/cmsis-svd/data/Microchip/ATSAM4LC.svd
        <register>
          <name>TTGR</name>
          <description>Transmitter Timeguard Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TG</name>
              <description>Timeguard Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <name>TGSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables the TX Timeguard function.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FIDI</name>
          <description>FI DI Ratio Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0x00000174</resetValue>
          <fields>
            <field>
              <name>FI_DI_RATIO</name>
              <description>FI Over DI Ratio Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <enumeratedValues>
                <name>FI_DI_RATIOSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Baud Rate = 0</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NER</name>
          <description>Number of Errors Register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NB_ERRORS</name>
              <description>Error number during ISO7816 transfers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IFR</name>
          <description>IrDA Filter Register</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IRDA_FILTER</name>
              <description>Irda filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MAN</name>
          <description>Manchester Configuration Register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0x30011004</resetValue>
          <fields>
            <field>
              <name>TX_PL</name>
              <description>Transmitter Preamble Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>TX_PLSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The Transmitter Preamble pattern generation is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_PP</name>
              <description>Transmitter Preamble Pattern</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>TX_PPSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>ALL_ONE</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ALL_ZERO</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>ZERO_ONE</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>ONE_ZERO</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_MPOL</name>
              <description>Transmitter Manchester Polarity</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TX_MPOLSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Logic Zero is coded as a zero-to-one transition, Logic One is coded as a one-to-zero transition</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Logic Zero is coded as a one-to-zero transition, Logic One is coded as a zero-to-one transition</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_PL</name>
              <description>Receiver Preamble Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>RX_PLSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The receiver preamble pattern detection is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_PP</name>
              <description>Receiver Preamble Pattern detected</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>RX_PPSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>ALL_ONE</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ALL_ZERO</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>ZERO_ONE</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>ONE_ZERO</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_MPOL</name>
              <description>Receiver Manchester Polarity</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RX_MPOLSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Logic Zero is coded as a zero-to-one transition, Logic One is coded as a one-to-zero transition</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Logic Zero is coded as a one-to-zero transition, Logic One is coded as a zero-to-one transition</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRIFT</name>
              <description>Drift compensation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DRIFTSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The USART can not recover from an important clock drift</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The USART can recover from clock drift. The 16X clock mode must be enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LINMR</name>
          <description>LIN Mode Register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NACT</name>
              <description>LIN Node Action</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>NACTSelect</name>
                <enumeratedValue>
                  <name>PUBLISH</name>
                  <description>The LIN Controller transmits the response</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUBSCRIBE</name>
                  <description>The LIN Controller receives the response</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IGNORE</name>
                  <description>The LIN Controller doesn't transmit and doesn't receive the response</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PARDIS</name>
              <description>Parity Disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHKDIS</name>
              <description>Checksum Disable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHKTYP</name>
              <description>Checksum Type</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DLM</name>
              <description>Data Length Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FSDIS</name>
              <description>Frame Slot Mode Disable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPTYP</name>
              <description>Wakeup Signal Type</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DLC</name>
              <description>Data Length Control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>PDCM</name>
              <description>PDC Mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCDIS</name>
              <description>Synchronization Disable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LINIR</name>
          <description>LIN Identifier Register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IDCHR</name>
              <description>Identifier Character</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LINBRR</name>
          <description>LIN Baud Rate Register</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LINCD</name>
              <description>Clock Divider after Synchronization</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>LINFP</name>
              <description>Fractional Part after Synchronization</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WPMR</name>
          <description>Write Protect Mode Register</description>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WPEN</name>
              <description>Write Protect Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>WPENSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disables the Write Protect if WPKEY corresponds to 0x858365 ("USA" in ACII)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enables the Write Protect if WPKEY corresponds to 0x858365 ("USA" in ACII)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WPKEY</name>
              <description>Write Protect Key</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WPSR</name>
          <description>Write Protect Status Register</description>
          <addressOffset>0xE8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>WPV</name>
              <description>Write Protect Violation Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>WPVSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>No Write Protect Violation has occurred since the last read of the WPSR register</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A Write Protect Violation has occurred since the last read of the WPSR register. If this violation is an unauthorized attempt to write a protected register, the associated violation is reported into field WPVSRC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WPVSRC</name>
              <description>Write Protect Violation Source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VERSION</name>
          <description>Version Register</description>
          <addressOffset>0xFC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000602</resetValue>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Version</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>MFN</name>
              <description>MFN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
