cmsis-svd/cmsis-svd/data/Microchip/ATSAM4LC.svd
        <register>
          <name>UHINT</name>
          <description>Host Global Interrupt Register</description>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DCONNI</name>
              <description>Device Connection Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DDISCI</name>
              <description>Device Disconnection Interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSTI</name>
              <description>USB Reset Sent Interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSMEDI</name>
              <description>Downstream Resume Sent Interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXRSMI</name>
              <description>Upstream Resume Received Interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HSOFI</name>
              <description>Host SOF Interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HWUPI</name>
              <description>Host Wake-Up Interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P0INT</name>
              <description>Pipe 0 Interrupt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P1INT</name>
              <description>Pipe 1 Interrupt</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P2INT</name>
              <description>Pipe 2 Interrupt</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P3INT</name>
              <description>Pipe 3 Interrupt</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P4INT</name>
              <description>Pipe 4 Interrupt</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P5INT</name>
              <description>Pipe 5 Interrupt</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P6INT</name>
              <description>Pipe 6 Interrupt</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UHINTCLR</name>
          <description>Host Global Interrrupt Clear Register</description>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DCONNIC</name>
              <description>DCONNI Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DDISCIC</name>
              <description>DDISCI Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSTIC</name>
              <description>RSTI Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSMEDIC</name>
              <description>RSMEDI Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXRSMIC</name>
              <description>RXRSMI Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HSOFIC</name>
              <description>HSOFI Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HWUPIC</name>
              <description>HWUPI Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UHINTSET</name>
          <description>Host Global Interrupt Set Register</description>
          <addressOffset>0x40C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DCONNIS</name>
              <description>DCONNI Set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DDISCIS</name>
              <description>DDISCI Set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSTIS</name>
              <description>RSTI Set</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSMEDIS</name>
              <description>RSMEDI Set</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXRSMIS</name>
              <description>RXRSMI Set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HSOFIS</name>
              <description>HSOFI Set</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HWUPIS</name>
              <description>HWUPI Set</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UHINTE</name>
          <description>Host Global Interrupt Enable Register</description>
          <addressOffset>0x410</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DCONNIE</name>
              <description>DCONNI Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DDISCIE</name>
              <description>DDISCI Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSTIE</name>
              <description>RSTI Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSMEDIE</name>
              <description>RSMEDI Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXRSMIE</name>
              <description>RXRSMI Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HSOFIE</name>
              <description>HSOFI Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HWUPIE</name>
              <description>HWUPI Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P0INTE</name>
              <description>P0INT Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P1INTE</name>
              <description>P1INT Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P2INTE</name>
              <description>P2INT Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P3INTE</name>
              <description>P3INT Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P4INTE</name>
              <description>P4INT Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P5INTE</name>
              <description>P5INT Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P6INTE</name>
              <description>P6INT Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P7INTE</name>
              <description>P7INT Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UHINTECLR</name>
          <description>Host Global Interrupt Enable Clear Register</description>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DCONNIEC</name>
              <description>DCONNIE Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DDISCIEC</name>
              <description>DDISCIE Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSTIEC</name>
              <description>RSTIE Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSMEDIEC</name>
              <description>RSMEDIE Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXRSMIEC</name>
              <description>RXRSMIE Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HSOFIEC</name>
              <description>HSOFIE Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HWUPIEC</name>
              <description>HWUPIE Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>P0INTEC</name>
              <description>P0INTE Clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>P1INTEC</name>
              <description>P1INTE Clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>P2INTEC</name>
              <description>P2INTE Clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>P3INTEC</name>
              <description>P3INTE Clear</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>P4INTEC</name>
              <description>P4INTE Clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>P5INTEC</name>
              <description>P5INTE Clear</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>P6INTEC</name>
              <description>P6INTE Clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>P7INTEC</name>
              <description>P7INTE Clear</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UHINTESET</name>
          <description>Host Global Interrupt Enable Set Register</description>
          <addressOffset>0x418</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DCONNIES</name>
              <description>DCONNIE Set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DDISCIES</name>
              <description>DDISCIE Set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSTIES</name>
              <description>RSTIE Set</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSMEDIES</name>
              <description>RSMEDIE Set</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXRSMIES</name>
              <description>RXRSMIE Set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HSOFIES</name>
              <description>HSOFIE Set</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HWUPIES</name>
              <description>HWUPIE Set</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>P0INTES</name>
              <description>P0INTE Set</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>P1INTES</name>
              <description>P1INTE Set</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>P2INTES</name>
              <description>P2INTE Set</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>P3INTES</name>
              <description>P3INTE Set</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>P4INTES</name>
              <description>P4INTE Set</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>P5INTES</name>
              <description>P5INTE Set</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>P6INTES</name>
              <description>P6INTE Set</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>P7INTES</name>
              <description>P7INTE Set</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UPRST</name>
          <description>Pipe Reset Register</description>
          <addressOffset>0x41C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PEN0</name>
              <description>Pipe0 Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEN1</name>
              <description>Pipe1 Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEN2</name>
              <description>Pipe2 Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEN3</name>
              <description>Pipe3 Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEN4</name>
              <description>Pipe4 Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEN5</name>
              <description>Pipe5 Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEN6</name>
              <description>Pipe6 Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEN7</name>
              <description>Pipe7 Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UHFNUM</name>
          <description>Host Frame Number Register</description>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MFNUM</name>
              <description>Micro Frame Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FNUM</name>
              <description>Frame Number</description>
              <bitOffset>3</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>FLENHIGH</name>
              <description>Frame Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
