cmsis-svd/cmsis-svd/data/Microchip/ATSAM4LC.svd
        <register>
          <name>UPCON6CLR</name>
          <description>Pipe Control Clear Register</description>
          <addressOffset>0x638</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RXINEC</name>
              <description>RXINE Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXOUTEC</name>
              <description>TXOUTE Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXSTPEC</name>
              <description>TXSTPE Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PERREC</name>
              <description>PERRE Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NAKEDEC</name>
              <description>NAKEDE Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ERRORFIEC</name>
              <description>ERRORFIE Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXSTALLDEC</name>
              <description>RXTALLDE Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RAMACEREC</name>
              <description>RAMACERE Clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NBUSYBKEC</name>
              <description>NBUSYBKE Clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FIFOCONC</name>
              <description>FIFOCON Clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PFREEZEC</name>
              <description>PFREEZE Clear</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INITDTGLC</name>
              <description>INITDTGL Clear</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INITBKC</name>
              <description>INITBK Clear</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UPCON7CLR</name>
          <description>Pipe Control Clear Register</description>
          <addressOffset>0x63C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RXINEC</name>
              <description>RXINE Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXOUTEC</name>
              <description>TXOUTE Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXSTPEC</name>
              <description>TXSTPE Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PERREC</name>
              <description>PERRE Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NAKEDEC</name>
              <description>NAKEDE Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ERRORFIEC</name>
              <description>ERRORFIE Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXSTALLDEC</name>
              <description>RXTALLDE Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RAMACEREC</name>
              <description>RAMACERE Clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NBUSYBKEC</name>
              <description>NBUSYBKE Clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FIFOCONC</name>
              <description>FIFOCON Clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PFREEZEC</name>
              <description>PFREEZE Clear</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INITDTGLC</name>
              <description>INITDTGL Clear</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INITBKC</name>
              <description>INITBK Clear</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UPINRQ0</name>
          <description>Pipe In Request</description>
          <addressOffset>0x650</addressOffset>
          <size>32</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>INRQ</name>
              <description>IN Request Number before Freeze</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INMODE</name>
              <description>IN Request Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UPINRQ1</name>
          <description>Pipe In Request</description>
          <addressOffset>0x654</addressOffset>
          <size>32</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>INRQ</name>
              <description>IN Request Number before Freeze</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INMODE</name>
              <description>IN Request Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UPINRQ2</name>
          <description>Pipe In Request</description>
          <addressOffset>0x658</addressOffset>
          <size>32</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>INRQ</name>
              <description>IN Request Number before Freeze</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INMODE</name>
              <description>IN Request Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UPINRQ3</name>
          <description>Pipe In Request</description>
          <addressOffset>0x65C</addressOffset>
          <size>32</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>INRQ</name>
              <description>IN Request Number before Freeze</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INMODE</name>
              <description>IN Request Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UPINRQ4</name>
          <description>Pipe In Request</description>
          <addressOffset>0x660</addressOffset>
          <size>32</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>INRQ</name>
              <description>IN Request Number before Freeze</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INMODE</name>
              <description>IN Request Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UPINRQ5</name>
          <description>Pipe In Request</description>
          <addressOffset>0x664</addressOffset>
          <size>32</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>INRQ</name>
              <description>IN Request Number before Freeze</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INMODE</name>
              <description>IN Request Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UPINRQ6</name>
          <description>Pipe In Request</description>
          <addressOffset>0x668</addressOffset>
          <size>32</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>INRQ</name>
              <description>IN Request Number before Freeze</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INMODE</name>
              <description>IN Request Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UPINRQ7</name>
          <description>Pipe In Request</description>
          <addressOffset>0x66C</addressOffset>
          <size>32</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>INRQ</name>
              <description>IN Request Number before Freeze</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INMODE</name>
              <description>IN Request Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>USBCON</name>
          <description>General Control Register</description>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <resetValue>0x01004000</resetValue>
          <fields>
            <field>
              <name>FRZCLK</name>
              <description>Freeze USB Clock</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBE</name>
              <description>USBC Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UIMOD</name>
              <description>USBC Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSTA</name>
          <description>General Status Register</description>
          <addressOffset>0x804</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00010000</resetValue>
          <fields>
            <field>
              <name>VBUSRQ</name>
              <description>VBus Request</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPEED</name>
              <description>Speed Status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>SPEEDSelect</name>
                <enumeratedValue>
                  <name>FULL</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKUSABLE</name>
              <description>USB Clock Usable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SUSPEND</name>
              <description>Suspend module state</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSTACLR</name>
          <description>General Status Clear Register</description>
          <addressOffset>0x808</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RAMACERIC</name>
              <description>RAMACERI Clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>VBUSRQC</name>
              <description>VBUSRQ Clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSTASET</name>
          <description>General Status Set Register</description>
          <addressOffset>0x80C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RAMACERIS</name>
              <description>RAMACERI Set</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>VBUSRQS</name>
              <description>VBUSRQ Set</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UVERS</name>
          <description>IP Version Register</description>
          <addressOffset>0x818</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000310</resetValue>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Version Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Variant Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UFEATURES</name>
          <description>IP Features Register</description>
          <addressOffset>0x81C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000007</resetValue>
          <fields>
            <field>
              <name>EPTNBRMAX</name>
              <description>Maximum Number of Pipes/Endpints</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>UTMIMODE</name>
              <description>UTMI Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UADDRSIZE</name>
          <description>IP PB address size Register</description>
          <addressOffset>0x820</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00001000</resetValue>
          <fields>
            <field>
              <name>UADDRSIZE</name>
              <description>IP PB Address Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UNAME1</name>
          <description>IP Name Part One: HUSB</description>
          <addressOffset>0x824</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x48555342</resetValue>
          <fields>
            <field>
              <name>UNAME1</name>
              <description>IP Name Part One</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UNAME2</name>
          <description>IP Name Part Two: HOST</description>
          <addressOffset>0x828</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x484F5354</resetValue>
          <fields>
            <field>
              <name>UNAME2</name>
              <description>IP Name Part Two</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
